<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');
/*
| -------------------------------------------------------------------
| Foreign Characters
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Text helper
|
*/
$foreign_characters = array(
    '/채|챈|퓰/' => 'ae',
    '/철|흹/' => 'oe',
    '/체/' => 'ue',
    '/횆/' => 'Ae',
    '/횥/' => 'Ue',
    '/횜/' => 'Oe',
    '/?|횁|횂|횄|횆|횇|퓟|?|훯|훲|?/' => 'A',
    '/횪|찼|창|찾|책|퓨|훮|훱|훳|?|짧/' => 'a',
    '/횉|훴|훷|훹|훻/' => 'C',
    '/챌|훶|훸|훺|훾/' => 'c',
    '/횖|훿|휂/' => 'D',
    '/챨|휁|휃/' => 'd',
    '/횊|횋|횎|횏|휅|휇|휉|휋|휍/' => 'E',
    '/챔|챕|챗|챘|휆|휈|휊|휌|휎/' => 'e',
    '/휏|휒|휔|칙/' => 'G',
    '/휐|휓|치|친/' => 'g',
    '/칟|칡/' => 'H',
    '/칠|침/' => 'h',
    '/횑|횒|횓|횕|칩|칭|칵|?|칼|캅/' => 'I',
    '/챙|챠|챤|챦|칫|카|칸|?|캄|캇/' => 'i',
    '/캑/' => 'J',
    '/캔/' => 'j',
    '/캘/' => 'K',
    '/캠/' => 'k',
    '/캣|캥|캭|커|흟/' => 'L',
    '/캤|캬|컁|?|흢/' => 'l',
    '/횗|흤|흧|흪/' => 'N',
    '/챰|흦|흨|흫|흭/' => 'n',
    '/횘|횙|횚|횛|흱|흳|?|흶|?|횠|퓸/' => 'O',
    '/챵|처|척|천|흲|흵|?|흷|퉤|첩|퓻|쨘/' => 'o',
    '/흺|흾|힀/' => 'R',
    '/흻|흿|힂/' => 'r',
    '/힃|힅|힇|힋/' => 'S',
    '/힄|힆|힊|큄|탓/' => 's',
    '/큅|큉|큔/' => 'T',
    '/큇|큐|큘/' => 't',
    '/횢|횣|횤|큠|큭|클|큽|키|킨|특|?|?|?|?|?/' => 'U',
    '/첫|첬|청|크|큰|큼|킁|킥|킬|튼|?|?|?|?|?/' => 'u',
    '/횦|타|킷/' => 'Y',
    '/첵|첼|킹/' => 'y',
    '/킴/' => 'W',
    '/킵/' => 'w',
    '/탁|탈|탐/' => 'Z',
    '/탄|탉|탑/' => 'z',
    '/횈|퓬/' => 'AE',
    '/횩/'=> 'ss',
    '/캉/' => 'IJ',
    '/캐/' => 'ij',
    '/흸/' => 'OE',
    '/?/' => 'f'
);

/* End of file foreign_chars.php */
/* Location: ./application/config/foreign_chars.php */